--------- A ---------
set transaction isolation level READ UNCOMMITTED --непотвержденное чтение
begin transaction 
-------------------------- t1 ------------------
select @@SPID ID, 'INSERT' Результат, 
	   * from ВИДЫ_КРЕДИТОВ where Название_кредита = '001'
select @@SPID Id, 'UPDATE AUDITORIUM' Результат, 
	   * from ВИДЫ_КРЕДИТОВ where Название_кредита = '001'
commit
-------------------------- t2 -----------------
--------- B ---------
begin transaction 
insert ВИДЫ_КРЕДИТОВ values ('001', 30)
update ВИДЫ_КРЕДИТОВ set Ставка = '40'
				  where Ставка = '30' 
-------------------------- t1 --------------------
-------------------------- t2 --------------------
rollback

begin transaction 
select count(*) from ВИДЫ_КРЕДИТОВ where Название_кредита = '001'
-------------------------- t1 ------------------ 
-------------------------- t2 -----------------
select 'update' Результат, ВИДЫ_КРЕДИТОВ.Ставка from ВИДЫ_КРЕДИТОВ where ВИДЫ_КРЕДИТОВ.Название_кредита = '001'
commit
--- B ---	
begin transaction 	  
-------------------------- t1 --------------------
update ВИДЫ_КРЕДИТОВ set Ставка = '10' where Название_кредита = '001' 
commit
-------------------------- t2 --------------------


-- A ---
set transaction isolation level  REPEATABLE READ --фантомное чтение
begin transaction 
select Ставка from ВИДЫ_КРЕДИТОВ where ВИДЫ_КРЕДИТОВ.Название_кредита = '001'
-------------------------- t1 ------------------ 
-------------------------- t2 ------------------
select ВИДЫ_КРЕДИТОВ.Название_кредита from ВИДЫ_КРЕДИТОВ where ВИДЫ_КРЕДИТОВ.Название_кредита = '001'
commit

--- B ---	
begin transaction 	  
-------------------------- t1 --------------------
insert ВИДЫ_КРЕДИТОВ values ('001',10);

commit