--Âûâåñòè êðåäèòû, íîèåðà òåëåôîíà êëèåíòîâ êîòîðûõ íà÷èíàåòñÿ íà +7 123
use SES_MyBase
SELECT ÊÐÅÄÈÒÛ.ID,ÊËÈÅÍÒÛ.Àäðåñ,ÊËÈÅÍÒÛ.Òåëåôîí
FROM ÊÐÅÄÈÒÛ,ÊËÈÅÍÒÛ
WHERE ÊÐÅÄÈÒÛ.ID_êëèåíòà=ÊËÈÅÍÒÛ.ID_êëèåíòà
	and
	Òåëåôîí in (SELECT Òåëåôîí FROM ÊËÈÅÍÒÛ
							WHERE (Òåëåôîí LIKE '+7 123%'))
--C èñïîëüçîâàíèåì INNER JOIN
SELECT ÊÐÅÄÈÒÛ.ID,ÊËÈÅÍÒÛ.Àäðåñ,ÊËÈÅÍÒÛ.Òåëåôîí
FROM ÊÐÅÄÈÒÛ INNER JOIN ÊËÈÅÍÒÛ
ON ÊÐÅÄÈÒÛ.ID_êëèåíòà=ÊËÈÅÍÒÛ.ID_êëèåíòà
WHERE	Òåëåôîí in (SELECT Òåëåôîí FROM ÊËÈÅÍÒÛ
							WHERE (Òåëåôîí LIKE '+7 123%'))
--Áåç èñïîëüçîâàíèÿ ïîäçàðïñîâ
SELECT ÊÐÅÄÈÒÛ.ID,ÊËÈÅÍÒÛ.Àäðåñ,ÊËÈÅÍÒÛ.Òåëåôîí
FROM ÊÐÅÄÈÒÛ INNER JOIN ÊËÈÅÍÒÛ
ON ÊÐÅÄÈÒÛ.ID_êëèåíòà=ÊËÈÅÍÒÛ.ID_êëèåíòà
WHERE	ÊËÈÅÍÒÛ.Òåëåôîí LIKE '+7 123%'
--Ïîëó÷èòü íàçâàíèå è ñòàâêó êðåäèòà ñ ìàêèñìàëüíîé ñóììîé
SELECT ÂÈÄÛ_ÊÐÅÄÈÒÎÂ.Íàçâàíèå_êðåäèòà, ÂÈÄÛ_ÊÐÅÄÈÒÎÂ.Ñòàâêà
FROM ÂÈÄÛ_ÊÐÅÄÈÒÎÂ 
WHERE ÂÈÄÛ_ÊÐÅÄÈÒÎÂ.Íàçâàíèå_êðåäèòà=(SELECT TOP(1) ÊÐÅÄÈÒÛ.Íàèìåíîâàíèå_êðåäèòà FROM ÊÐÅÄÈÒÛ
										ORDER BY ÊÐÅÄÈÒÛ.Ñóììà DESC)
--Íè ðàçó íå îôîðìåëííûå âèäû êðåäèòîâ
SELECT ÂÈÄÛ_ÊÐÅÄÈÒÎÂ.Íàçâàíèå_êðåäèòà 
FROM ÂÈÄÛ_ÊÐÅÄÈÒÎÂ
WHERE NOT EXISTS (SELECT ÊÐÅÄÈÒÛ.Íàèìåíîâàíèå_êðåäèòà FROM ÊÐÅÄÈÒÛ
					WHERE ÊÐÅÄÈÒÛ.Íàèìåíîâàíèå_êðåäèòà=ÂÈÄÛ_ÊÐÅÄÈÒÎÂ.Íàçâàíèå_êðåäèòà)
 --Ñðåäíåå çàí÷åíèå ñóììû êðåäèòîâ
 SELECT AVG(ÊÐÅÄÈÒÛ.Ñóììà) AS Ñðåäíÿÿ_ñóììà
 FROM ÊÐÅÄÈÒÛ
 USE SES_MyBase
 --êëèåíòû, ó êîòîðûõ âñå êðåäèòû èìåþò ñóììó áîëüøå 100000
 SELECT k.Íàçâàíèå_ôèðìû
FROM ÊËÈÅÍÒÛ as k
WHERE k.ID_êëèåíòà =all (
    SELECT kk.ID_êëèåíòà
    FROM ÊÐÅÄÈÒÛ as kk
    WHERE kk.ID_êëèåíòà=k.ID_êëèåíòà
	AND kk.Ñóììà>10000
)
 --êëèåíòû, ó êîòîðûõ õîòÿ áû îäèí êðåäèò íà ñóììó áîëüøå 100000
SELECT k.Íàçâàíèå_ôèðìû
FROM ÊËÈÅÍÒÛ as k
WHERE k.ID_êëèåíòà =any (
    SELECT kk.ID_êëèåíòà
    FROM ÊÐÅÄÈÒÛ as kk
    WHERE kk.ID_êëèåíòà=k.ID_êëèåíòà
	AND kk.Ñóììà>10000
)